#!/usr/bin/env python3
# -*- coding: utf-8 -*-

'''
生成num条随机数据到file指定的csv文件
调用方式： python gendata.py num file
例：python gendata.py 100 d:/data.csv

'''

import random
import csv
from sys import argv

item_num,csv_file=int(argv[1]), argv[2]
#item_num,csv_file=10, 'D:/test.csv'

#一个字和两个字的名字的比例（加姓即为2字、3字或4字）
ratio_of_1_2_char_name=[1,1,2,2,2]
#有PDA的权重列表,1——有PDA
haspda=['1','1','1','0']
#已失效员工的权重列表,1——失效
deltag=['0','0','0','1']
#分公司列表，也可简化为数字
stations=['北京一公司','北京二公司','北京三公司','河北一公司','河北二公司',\
'四川一公司','四川二公司','山西一公司','海南三公司','西藏总公司','辽宁四公司']
#收取标准，简化为1-10个数字
standard=[str(i) for i in range(1,10)]

#表头
head=['name','telephone','haspda','deltag','station','standard']

#电话号码头三位列表
phone_head_3=['139', '135', '188','185','136','158','151', '152', '181','186']

#姓氏数据库
xing={"赵","钱","孙","李","周","吴","郑","王","冯","陈","楮","卫","蒋","沈","韩","杨",  \
"朱","秦","尤","许","何","吕","施","张","孔","曹","严","华","金","魏","陶","姜",  \
"戚","谢","邹","喻","柏","水","窦","章","云","苏","潘","葛","奚","范","彭","郎",  \
"鲁","韦","昌","马","苗","凤","花","方","俞","任","袁","柳","酆","鲍","史","唐",  \
"费","廉","岑","薛","雷","贺","倪","汤","滕","殷","罗","毕","郝","邬","安","常",  \
"乐","于","时","傅","皮","卞","齐","康","伍","余","元","卜","顾","孟","平","黄",  \
"和","穆","萧","尹","姚","邵","湛","汪","祁","毛","禹","狄","米","贝","明","臧",  \
"计","伏","成","戴","谈","宋","茅","庞","熊","纪","舒","屈","项","祝","董","梁",  \
"杜","阮","蓝","闽","席","季","麻","强","贾","路","娄","危","江","童","颜","郭",  \
"梅","盛","林","刁","锺","徐","丘","骆","高","夏","蔡","田","樊","胡","凌","霍",  \
"公孙","仲孙","轩辕","令狐","宇文","长孙","慕容","司徒","司空","拓拔","百里","东郭","西门","南宫"}

#名字可选汉字列表
ming="嘉琼桂娣叶璧璐娅琦晶妍茜秋珊莎锦黛青倩\
婷姣婉娴瑾颖露瑶怡婵雁蓓纨仪荷丹蓉眉君琴蕊薇菁梦岚苑婕馨瑗琰韵融园艺咏卿聪澜\
纯毓悦昭冰爽琬茗羽希宁欣飘育滢馥筠柔竹涛昌进林有坚和彪博诚先敬震振壮会群豪心\
邦承乐绍功松善厚庆磊民友裕河哲江超浩亮政谦亨奇固之轮翰朗伯宏言若鸣朋斌梁栋维\
启克伦翔旭鹏泽晨辰士以建家致树炎德行时泰盛雄琛钧冠策腾伟刚勇毅俊峰强军平保东\
文辉力明永健世广志义兴良海山仁波宁贵福生龙元全国胜学祥才发成康星光天达安岩中\
茂武新利清飞彬富顺信子杰楠榕风航弘圣诚杰安博彬宝斌超盛畅灿纯恩帆福富贵桂瀚豪\
翰皓弘恒海宏洪涵慧荷蕙航嘉俊君峻健和禾佳静娇娟净睛善康坤兰岚莲丽立亮伶俪明名\
铭美宁朋鹏琪芹清晴胜思顺舒森升潭婷伟文益宜韵阳运乐怡芸盈园翊智哲志振展忠昭真\
正雅悦莹娅欣勋轩旭新熙金真"

def rand_phonenum():
	return random.choice(phone_head_3)+"".join(random. sample ("0123456789",8 ))


def rand_name():
	return "".join(random.sample(xing, 1)+random.sample(ming, random.choice(ratio_of_1_2_char_name)))

def gen_csv(num):
	table=[head]
	for i in range(1,num):
		item=[rand_name(), rand_phonenum(), random.choice(haspda), random.choice(deltag), random.choice(stations), random.choice(standard)]
		#row="".join(item)
		table.append(item)
	#print(table)
	with open(csv_file, 'w', newline='') as f:
		writer = csv.writer(f)
		#writer.writerow(["name"])
		writer.writerows(table)

if __name__ == '__main__':
	gen_csv(item_num)
